source/org_posts/2010-12-13-installing-password-gorilla-on-fedora-14.org
#+TITLE: Installing Password Gorilla on Fedora 14
#+AUTHOR: PerlStalker
#+DATE: [2010-12-13 Mon 06:44]
#+begin_html
---
layout: post
title: Installing Password Gorilla on Fedora 14
date: 2010-12-13 06:44
comments: true
categories: [fedora]
---
#+end_html
/Originally posted at [2010-12-13 Mon 06:44]/

I switched to Fedora 14 on my laptop a few weeks back. It's been working great
but there's no package for the [[https://github.com/zdia/gorilla][Password Gorilla]] which I use to keep track of
passwords. Fortunately, installing from source is easy.

: yum install tk itcl

Now that the prereqs are installed, we can grab the source. I checked out the
code from the git repository but you can get the tarball. Since gorilla is a
TCL app, there's nothing to compile. Running it is easy.

#+BEGIN_SRC sh
cd gorilla
sources/gorilla.tcl
#+END_SRC

That's it. You should be good to go.
