source/_posts/2010-12-13-installing-password-gorilla-on-fedora-14.html
---
layout: post
title: Installing Password Gorilla on Fedora 14
date: 2010-12-13 06:44
comments: true
categories: [fedora]
---
<p>
<i>Originally posted at <span class="timestamp-wrapper"><span class="timestamp">[2010-12-13 Mon 06:44]</span></span></i>
</p>

<p>
I switched to Fedora 14 on my laptop a few weeks back. It's been working great
but there's no package for the <a href="https://github.com/zdia/gorilla">Password Gorilla</a> which I use to keep track of
passwords. Fortunately, installing from source is easy.
</p>

<pre class="example">
yum install tk itcl
</pre>

<p>
Now that the prereqs are installed, we can grab the source. I checked out the
code from the git repository but you can get the tarball. Since gorilla is a
TCL app, there's nothing to compile. Running it is easy.
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b0c4de;">cd</span> gorilla
sources/gorilla.tcl
</pre>
</div>

<p>
That's it. You should be good to go.
</p>
